package Class3;

public class HomeWork3 {

}


/**
  <pre>
    3-1.請使用for迴圈，練習印出以下圖案
    *
    **
    ***
    ****
    *****
    ****
    ***
    **
    *
  </pre>
*/
class q3_1{
  
}


/**
   3-2. 請使用for迴圈與While迴圈，寫出99乘法表
 */
class q3_2{
  
  public void usingFor(){
    
  }
  
  public void usingWhile(){
    
  }
}


/** 
  3-3. 請使用for迴圈，先用一個整數一維陣列儲存1900~2017年後，判斷那幾年是閏年? 
 */
class q3_3 {
  
}


/**
 * <pre>
 * 有三個學生，期末考結束了，公佈了三科成績，請幫我算一下各科平均分數，每個人平均分數，需要精確到小數點兩位。
 *
 *  姓名  數學    國文   英文
 *  小乖   95    80   77
 *  小忍   55    87   89
 *  小天   71    78   88
 * </pre>
 */
class q3_4 {
  
}


/**
 * 3-5.有一組52張撲克牌(不含鬼牌)，請幫我進行發牌動作，並且發給四個人(不重覆)。 
 */
class q3_5 {
  
}











