package Class7;

public class Homework7 {

}

/**
 * <pre> 
 * 
 *  今天各位要準備開一家飲料店
 *  請使用物件導向方式
 *  設計出以下幾個類別以及簡潔的點餐系統
 *  
 *  飲料 : 要有"基本說明"，"材料"，"容量"，"卡洛里"與"價格"
 *  
 *  飲料調整方式 : 飲料基本上會有"冰塊"，"甜度"，"大杯中杯"
 *                的調整，請思考一下，如何搭配飲料類別去實作?
 *                
 *  菜單 : 裡面需要包含一些基本飲料
 *  
 *  點餐 : 1.使用者執行這個程式後
 *          看到一個簡單的飲料清單
 *           
 *        2.使用者開始點餐，需要記錄使用者點了甚麼飲料
 *          還有冰塊，糖度，等等
 *          
 *        3.點餐完畢，顯示使用者點完的結果   
 *  
 *  Hit : 需要看到繼承，多型，封裝這三種物件導向基礎的類別設計
 * </pre>
 */
class Q7_1 {
  
}
