package Class6;

public class HomeWork6 {

}

/**
 * <pre> 
 * 
 * 請使用Map物件，處理以下問題
 * 
 * 會員資料
 * 編號  姓名
 * C1    藍色
 * C2    香菇
 * C3    小草
 * 
 * 1.會員編號C1的姓名更改成紅色，並印出前後修改的內容
 * 2.會員編號C2已被停止使用，新增一個新的會員資料
 *   編號:C4 ,  姓名: 天天，並印出整體會員資料
 * 
 * </pre> 
 */
class Q6_1{
  
}

/**
 * <pre> 
 * 請使用List物件，處理以下問題
 * 
 * 會員資料
 * 編號  姓名
 * C1    藍色
 * C2    香菇
 * C3    小草
 * 
 * 1.會員編號C1的姓名更改成紅色，並印出前後修改的內容
 * 2.會員編號C2已被停止使用，新增一個新的會員資料
 *   編號:C4 ,  姓名: 天天，並印出整體會員資料
 *   
 * </pre> 
 */
class Q6_2{
  
}

/**
 * <pre>
 * 使用Set物件與Random物件搭配
 * 產生10組大樂透號碼 
 * </pre>
 */
class Q6_3{
  
}

/**
 * <pre>
 * 
 * 以下請使用Map物件儲存以下資訊
 * 並解決四個問題
 * 
 * 會員資料
 * 編號  姓名
 * C1    小Q
 * C2    小咪
 * C3    查理
 * 
 * 訂單資料
 * 訂單 會員編號  訂購內容     金額
 * O001     C1      衣服        789
 * O002     C1        3C       1999
 * O003     C2      遊戲       1899
 * O004     C2    保養品       3300
 * O005     C3    攝影機      14999
 * 
 * 請用新增會員與訂單類別(Class)
 * 設定每位會員資料以及訂單資料後
 * 
 * 1.用會員編號查詢會員買的商品
 *   輸出格式 => 編號 姓名 訂單 訂購內容 金額
 *   
 * 2.算出每位會員的平均消費金額
 *   輸出格式 => 編號 姓名 平均金額
 *   
 * 3.依照消費總金額高到低排序
 *   輸出格式 => 編號 姓名 消費總金額
 *   
 * 4.依照消費總金額低到高排序
 *   輸出格式 => 編號 姓名 消費總金額
 *   
 * </pre> 
 */
class Q6_4{
  
}

/**
 * <pre>
 * 
 * 以下請使用List物件儲存以下資訊
 * 並解決四個問題
 * 
 * 會員資料
 * 編號  姓名
 * C1    小Q
 * C2    小咪
 * C3    查理
 * 
 * 訂單資料
 * 訂單 會員編號  訂購內容     金額
 * O001     C1      衣服        789
 * O002     C1        3C       1999
 * O003     C2      遊戲       1899
 * O004     C2    保養品       3300
 * O005     C3    攝影機      14999
 * 
 * 請用新增會員與訂單類別(Class)
 * 設定每位會員資料以及訂單資料後
 * 
 * 1.用會員編號找出會員買的商品
 *   輸出格式 => 編號 姓名 訂單 訂購內容 金額
 *   
 * 2.算出每位會員的平均消費金額
 *   輸出格式 => 編號 姓名 平均金額
 *   
 * 3.依照消費總金額高到低排序
 *   輸出格式 => 編號 姓名 消費總金額
 *   
 * 4.依照消費總金額低到高排序
 *   輸出格式 => 編號 姓名 消費總金額
 *   
 * </pre> 
 */
class Q6_5{
  
}
